app/controllers/tasks_controller.rb

INSERT INTO "tasks" ("title", "created_at", "updated_at") VALUES (?, ?, ?)  [["title", "task4"], ["created_at", "2020-03-15 04:57:22.416249"], ["updated_at", "2020-03-15 04:57:22.416249"]]
---
  def create
    @task = Task.new(task_params)

    if @task.save

SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "tasks" SET "title" = ?, "updated_at" = ? WHERE "tasks"."id" = ?  [["title", "test999"], ["updated_at", "2020-03-15 05:39:04.261196"], ["id", 1]]
---
  def update
    @task = Task.find(params[:id])

    if @task.update(task_params)

SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "tasks" SET "done" = ?, "updated_at" = ? WHERE "tasks"."id" = ?  [["done", 1], ["updated_at", "2020-03-15 06:27:08.685650"], ["id", 2]]
---
  def toggle
    head :no_content
    @task = Task.find(params[:id])
    @task.done = !@task.done
    @task.save